yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_i2c1.h
#define RP2040_I2C1_IC_CON_STOP_DET_IF_MASTER_ACTIVE          (1 << 10)  /* Master issues the STOP_DET interrupt irrespective of whether master is active or not */
#define RP2040_I2C1_IC_CON_RX_FIFO_FULL_HLD_CTRL              (1 << 9)  /* Hold bus when RX_FIFO is full */
#define RP2040_I2C1_IC_CON_TX_EMPTY_CTRL                      (1 << 8)  /* Controlled generation of TX_EMPTY interrupt */
#define RP2040_I2C1_IC_CON_STOP_DET_IFADDRESSED               (1 << 7)  /* slave issues STOP_DET intr only if addressed */
#define RP2040_I2C1_IC_CON_IC_SLAVE_DISABLE                   (1 << 6)  /* Slave mode is disabled */
#define RP2040_I2C1_IC_CON_IC_RESTART_EN                      (1 << 5)  /* Master restart enabled */
#define RP2040_I2C1_IC_CON_IC_10BITADDR_MASTER                (1 << 4)  /* Master 10Bit addressing mode */
#define RP2040_I2C1_IC_CON_IC_10BITADDR_SLAVE                 (1 << 3)  /* Slave 10Bit addressing */
#define RP2040_I2C1_IC_CON_SPEED_SHIFT                        (1)  /* These bits control at which speed the DW_apb_i2c operates; its setting is relevant only if one is operating the DW_apb_i2c in master mode. Hardware protects against illegal values being programmed by software. These bits must be programmed appropriately for slave mode also, as it is used to capture correct value of spike filter as per the speed mode.  This register should be programmed only with a value in the range of 1 to IC_MAX_SPEED_MODE; otherwise, hardware updates this register with the value of IC_MAX_SPEED_MODE.  1: standard mode (100 kbit/s)  2: fast mode (<=400 kbit/s) or fast mode plus (<=1000Kbit/s)  3: high speed mode (3.4 Mbit/s)  Note: This field is not applicable when IC_ULTRA_FAST_MODE=1 */
#define RP2040_I2C1_IC_CON_SPEED_MASK                         (0x03 << RP2040_I2C1_IC_CON_SPEED_SHIFT)
#define RP2040_I2C1_IC_CON_SPEED_STANDARD                     (0x1 << RP2040_I2C1_IC_CON_SPEED_SHIFT)  /* Standard Speed mode of operation */
#define RP2040_I2C1_IC_CON_SPEED_FAST                         (0x2 << RP2040_I2C1_IC_CON_SPEED_SHIFT)  /* Fast or Fast Plus mode of operation */
#define RP2040_I2C1_IC_CON_SPEED_HIGH                         (0x3 << RP2040_I2C1_IC_CON_SPEED_SHIFT)  /* High Speed mode of operation */
#define RP2040_I2C1_IC_CON_MASTER_MODE                        (1 << 0)  /* Master mode is enabled */

#define RP2040_I2C1_IC_TAR_SPECIAL                            (1 << 11)  /* Enables programming of GENERAL_CALL or START_BYTE transmission */
#define RP2040_I2C1_IC_TAR_GC_OR_START                        (1 << 10)  /* START byte transmission */
#define RP2040_I2C1_IC_TAR_MASK                               (0x3ff)  /* This is the target address for any master transaction. When transmitting a General Call, these bits are ignored. To generate a START BYTE, the CPU needs to write only once into these bits.  If the IC_TAR and IC_SAR are the same, loopback exists but the FIFOs are shared between master and slave, so full loopback is not feasible. Only one direction loopback mode is supported (simplex), not duplex. A master cannot transmit to itself; it can transmit to only a slave. */

#define RP2040_I2C1_IC_SAR_MASK                               (0x3ff)  /* The IC_SAR holds the slave address when the I2C is operating as a slave. For 7-bit addressing, only IC_SAR[6:0] is used.  This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.  Note: The default values cannot be any of the reserved address locations: that is, 0x00 to 0x07, or 0x78 to 0x7f. The correct operation of the device is not guaranteed if you program the IC_SAR or IC_TAR to a reserved value. Refer to <<table_I2C_firstbyte_bit_defs>> for a complete list of these reserved values. */

#define RP2040_I2C1_IC_DATA_CMD_FIRST_DATA_BYTE               (1 << 11)  /* Non sequential data byte received */
#define RP2040_I2C1_IC_DATA_CMD_RESTART                       (1 << 10)  /* Issue RESTART before this command */
#define RP2040_I2C1_IC_DATA_CMD_STOP                          (1 << 9)  /* Issue STOP after this command */
#define RP2040_I2C1_IC_DATA_CMD_CMD                           (1 << 8)  /* Master Read Command */
#define RP2040_I2C1_IC_DATA_CMD_DAT_MASK                      (0xff)  /* This register contains the data to be transmitted or received on the I2C bus. If you are writing to this register and want to perform a read, bits 7:0 (DAT) are ignored by the DW_apb_i2c. However, when you read this register, these bits return the value of data received on the DW_apb_i2c interface.  Reset value: 0x0 */

#define RP2040_I2C1_IC_SS_SCL_HCNT_MASK                       (0xffff)  /* This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock high-period count for standard speed. For more information, refer to 'IC_CLK Frequency Configuration'.  This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.  The minimum valid value is 6; hardware prevents values less than this being written, and if attempted results in 6 being set. For designs with APB_DATA_WIDTH = 8, the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed.  NOTE: This register must not be programmed to a value higher than 65525, because DW_apb_i2c uses a 16-bit counter to flag an I2C bus idle condition when this counter reaches a value of IC_SS_SCL_HCNT + 10. */

#define RP2040_I2C1_IC_SS_SCL_LCNT_MASK                       (0xffff)  /* This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock low period count for standard speed. For more information, refer to 'IC_CLK Frequency Configuration'  This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.  The minimum valid value is 8; hardware prevents values less than this being written, and if attempted, results in 8 being set. For designs with APB_DATA_WIDTH = 8, the order of programming is important to ensure the correct operation of DW_apb_i2c. The lower byte must be programmed first, and then the upper byte is programmed. */

#define RP2040_I2C1_IC_FS_SCL_HCNT_MASK                       (0xffff)  /* This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock high-period count for fast mode or fast mode plus. It is used in high-speed mode to send the Master Code and START BYTE or General CALL. For more information, refer to 'IC_CLK Frequency Configuration'.  This register goes away and becomes read-only returning 0s if IC_MAX_SPEED_MODE = standard. This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.  The minimum valid value is 6; hardware prevents values less than this being written, and if attempted results in 6 being set. For designs with APB_DATA_WIDTH == 8 the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed. */

